{"pageProps":{"post":{"title":"Yang biasanya saya lakukan setelah install arch linux","date":"2020-12-14","slug":"hal-yang-dilakukan-setelah-install-arch-linux","desc":"Sedikit mengenai hal-hal apa saja yang biasanya saya lakukan setelah menginstal arch linux","tags":["arch","linux"],"content":"<h2>Mengenal Arch Linux</h2>\n<p>Arch linux adalah salah satu distro dari GNU/linux yang berfokus pada kesederhanaan.</p>\n<p>Dengan jargonya yaitu KISS ( Kepp It Simple Stupid ),arch linux membaskan penggunanya untuk membuat environment sesuai dengan kebutuhanya.</p>\n<p>Maksudnya arch linux hanya memberikan sistem dasarnya saja, ibaratkan rumah arch linux hanya memberikan fondasinya, sementara itu\ntembok,jendela,pintu,desain interior dan exterior terserah pengguna tersebut mau dibikin model seperti apa.</p>\n<p>Ini sangat menguntungkan bagi pengguna laptop kentang seperti saya,karena resource pada laptop saya tidak terbuang sia-sia untuk\naplikasi yang tidak saya butuhkan.</p>\n<p>Tentu setiap pengguna mempunyai kebutuhan yang berbeda-beda,Saya sendiri kebutuhanya cuma buat nonton anime jadi pada artikel kali ini\nsaya akan sedikit berbagi hal-hal apa saja yang harus dilakukan setelah install arch linux <strong>untuk kebutuhan nonton anime</strong>.</p>\n<h2>Display Server</h2>\n<p>Agar aplikasi berbasis GUI kita dapat berjalan kita membutuhkan sebuah display server atau window system.Itu berarti display server adalah\naplikasi wajib yang harus kita install kecuali mungkin pada komputer server yang tidak membutuhkan aplikasi berbasis GUI.display server\nyang paling banyak digunakan di linux saat ini adalah Xorg.</p>\n<div><pre><code>pacman -S xorg-server\n</code></pre></div>\n<h2>Window Manager</h2>\n<p>Untuk bisa menjalankan aplikasi berbasis GUI, tidak cukup hanya dengan display server seperti xorg, kita juga butuh sebuah aplikasi\nyang bertugas untuk menyediakan <strong>window</strong> bagi aplikasi yang akan kita jalankan.Aplikasi tersebut bernama Window Manager.Window Manager\nbiasanya sudah menjadi satu paket dengan Desktop Environment seperti gnome,xfce,mate,kde dll.</p>\n<p>karena saya ingin system yang say gunakan seminimalis\nmungkin saya lebih memilih window manager yang bisa berdiri sendiri atau independen, contohnya seperti openbox,dwm,bspwm,i3wm dll.\nsalah satu window manager yang paling saya sukai adalah openbox.</p>\n<div><pre><code>pacman -S openbox\n</code></pre></div>\n<h2>Display Manager</h2>\n<p>Display manager adalah program yang bertugas untuk mengatur proses login.dalam hal ini melakukan user authentication dan menjalankan\nsebuah session.Session disisni berisi sebuah perintah untuk menjalankan desktop environtment/window manager.</p>\n<p>Salah satu bagian dari display manager adalah greeter.Greeter inilah yang bertugas membuat tampilan login.\nGreeter biasanya sudah dalam satu paket bersama display manager.\nAda banyak macam display manager, saya sendiri lebih menyukai slim.</p>\n<div><pre><code>sudo pacman -S slim</code></pre></div>\n<h2>Sudo</h2>\n<p>Pada sistem operasi linux untuk menginstall aplikasi kita perlu login sebagai root,dengan sudo kita bisa menginstall aplikasi sebagai\nuser biasa.</p>\n<div><pre><code>pacman -S <span>sudo</span>\n</code></pre></div>\n<h2>AUR</h2>\n<p>Didalam arch linux adal 2 repository yaitu AUR dan repository resmi.\nAUR ( Arch User Repository ) adalah repository yang berbasis kominitas pengguna arch linux.Itu artinya package yang ada didalam AUR\ndiibuat oleh para pengguna arch linux.</p>\n<p>Terus apa kelebihanya ? kelebihanya adalah AUR banyak menyediakan aplikasi yang tidak ada didalam\nrepository resmi.Karena pengguna arch linux mempunyai inisiatif tinggi, mereke biasanya membuat package yang tidak ada dalam repository\nresmi kemudian me release-nya ke AUR agar dapat digunakan oleh pengguna arch linux lain.</p>\n<p>Untuk lebih mudah menginstall aplikasi menggunakan AUR, kita bisa menggunakan AUR helper seperti yay,yaourt,paru,pikaur dll.\nsaya sendiri lebih memilih menggunakan yay.</p>\n<div><pre><code><span>sudo</span> pacman -S <span>git</span> base-devel\n<span>git</span> clone https://aur.archlinux.org/yay.git\n<span>cd</span> yay\nmakepkg -si\n</code></pre></div>\n<h2>Aplikasi pendukung lainya</h2>\n<div><pre><code>sudo pacman -S nitrogen lxappearance tint2 thunar firefox neovim xarchiver obconf polkit-gnome notify-send dunst\nyay -S obmenu-generator</code></pre></div>\n<h2>Penjelasan</h2>\n<ul>\n<li><strong>Nitrogen</strong> adalah aplikasi berbasis gui untuk mengatur wallpaper.</li>\n<li><strong>Lxappearance</strong> adalah aplikasi untuk mengatur gtk theme.</li>\n<li><strong>Tint2</strong> adalah panel atau bar yang kita gunakan untuk menampilkan beerapa informasi seperti jam, tanggal, memori usage, task list dll.</li>\n<li><strong>Thunar</strong> adalah aplikasi untuk file manager.</li>\n<li><strong>Firefox</strong> adalah browser favorit saya.</li>\n<li><strong>Neovim</strong> adalah the best text editor in the world.</li>\n<li><strong>Xarchiver</strong> adalah aplikasi yang digunakan untuk mengesktrak atau mengkompress file.</li>\n<li><strong>Obconf</strong> adalah aplikasi yang digunakan untuk mengatur tema openbox kita.</li>\n<li><strong>Obmenu-generaor</strong> adalah aplikasi untuk menggenerate menu openbox.</li>\n<li><strong>Polkit-gnome</strong> adalah aplikasi yang digunakan untuk user authentication, mirip seperti sudo tetapi berbasi GUI.</li>\n<li><strong>notify-send</strong> adalah aplikasi untuk mengirim notifikasi.</li>\n<li><strong>dunst</strong> adalah apliaksi yang bertugas sebagai noitifikasi daemon.</li>\n</ul>\n<h2>Konfigurasi</h2>\n<p>Setelah semua aplikasi yang saya butuhkan sudah terinstall saatnya mengkonfigurasi apliaksi tersebut agar berjalan sesuai dengan apa\nyang kita inginkan.</p>\n<h2>Konfigurasi slim</h2>\n<p>File konfigurasi slim berada di <code>/etc/slim.conf</code>, jadi mari kita buka file tersebut.</p>\n<div><pre><code><span>sudo</span> <span>nano</span> /etc/slim.conf\n<span>sudo</span> systemctl <span>enable</span> slim.service\n</code></pre></div>\n<p>untuk konfigurasi dasar kita cukup uncomment bagian sessiondir</p>\n<div><pre><code><span># Set directory that contains the xsessions.</span>\n<span># slim reads xsesion from this directory, and be able to select.</span>\nsessiondir            /usr/share/xsessions/\n</code></pre></div>\n<p>secara otomatis slim akan membaca daftar session yang ada di directory tersebut, karena kita sudah menginstall openbox, maka di directory\n<code>/usr/share/xsessions/</code> harusnya ada file <code>openbox-session</code>.</p>\n<p>Jika kita mempunyai lebih dari satu session untuk memilih session mana yang kita ambil bisa menggunakan tombol f1.</p>\n<p>Setelah selesai konfigurasi slim mari kita reboot.Harusnya kita sudah bisa masuk ke desktop.</p>\n<h2>Konfigurasi sudo</h2>\n<div><pre><code><span>nano</span> /etc/sudoers\n<span># lalu tambahkan konfigurasi berikut</span>\n%wheel ALL <span>=</span> ALL ALL\n</code></pre></div>\n<h2>Konfigurasi openbox</h2>\n<p>openbox mempunyai 3 file konfigurasi yaitu :</p>\n<ul>\n<li><strong>autostart</strong> berisi aplikasi yang akan otomatis berjalan ketika masuk ke openbox.</li>\n<li><strong>menu.xml</strong> berisi item yang akan tampil ketika kita menekan klik kanan.</li>\n<li><strong>rc.xml</strong> adalah file konfigurasi utama openbox, didalamnya ada banyak konfigurasi seperti font, titlebar, shortcut, mousebind dan lain-lain.</li>\n</ul>\n<p>Secara default openbox hanya menyediakan global konfigurasi yang berada di <code>/etc/xdg/openbox</code>, untuk membuat konfigurasi lokal kita perlu\nmenyalinya ke directory <code>~/.config/openbox</code></p>\n<div><pre><code><span>mkdir</span> ~/.config/openbox\n<span>cp</span> -a /etc/xdg/openbox/ ~/.config/openbox/\n</code></pre></div>\n<p>sekarang saatnya mengatur file <code>autostart</code></p>\n<div><pre><code>nitrogen --restore\ntint2\n/usr/lib/polkit-gnome/polkit-gnome-authentication-agent-1\ndunst</code></pre></div>\n<h2>Penutup</h2>\n<p>Sejauh ini Arch linux adalah distro GNU/linux yang paling lama saya singgahi karena adanya AUR yang sangat memudahkan saya\ndalam berbagai masalah.Dan rasanya saya belum ingin melirik distro lain.</p>\n"}},"__N_SSG":true}